Microchip-MPLAB-Harmony/touch_apps/apps/qt8_selfcap_surface_xpro_board/pic32cm_pl10_cnano_water_tolerance/firmware/src/packs/PIC32CM6408PL10048_DFP/component/eic.h
#define EIC_INTFLAG_EXTINT_Pos                _UINT32_(0)                                          /* (EIC_INTFLAG Position) External Interrupt x5 */
#define EIC_INTFLAG_EXTINT_Msk                (_UINT32_(0xFFFF) << EIC_INTFLAG_EXTINT_Pos)         /* (EIC_INTFLAG Mask) EXTINT */
#define EIC_INTFLAG_EXTINT(value)             (EIC_INTFLAG_EXTINT_Msk & (_UINT32_(value) << EIC_INTFLAG_EXTINT_Pos)) 

/* -------- EIC_ASYNCH : (EIC Offset: 0x18) (R/W 32) External Interrupt Asynchronous Mode -------- */
#define EIC_ASYNCH_RESETVALUE                 _UINT32_(0x00)                                       /*  (EIC_ASYNCH) External Interrupt Asynchronous Mode  Reset Value */

#define EIC_ASYNCH_ASYNCH0_Pos                _UINT32_(0)                                          /* (EIC_ASYNCH) Asynchronous Edge Detection Mode 0 Position */
#define EIC_ASYNCH_ASYNCH0_Msk                (_UINT32_(0x1) << EIC_ASYNCH_ASYNCH0_Pos)            /* (EIC_ASYNCH) Asynchronous Edge Detection Mode 0 Mask */
#define EIC_ASYNCH_ASYNCH0(value)             (EIC_ASYNCH_ASYNCH0_Msk & (_UINT32_(value) << EIC_ASYNCH_ASYNCH0_Pos)) /* Assignment of value for ASYNCH0 in the EIC_ASYNCH register */
#define EIC_ASYNCH_ASYNCH1_Pos                _UINT32_(1)                                          /* (EIC_ASYNCH) Asynchronous Edge Detection Mode 1 Position */
#define EIC_ASYNCH_ASYNCH1_Msk                (_UINT32_(0x1) << EIC_ASYNCH_ASYNCH1_Pos)            /* (EIC_ASYNCH) Asynchronous Edge Detection Mode 1 Mask */
#define EIC_ASYNCH_ASYNCH1(value)             (EIC_ASYNCH_ASYNCH1_Msk & (_UINT32_(value) << EIC_ASYNCH_ASYNCH1_Pos)) /* Assignment of value for ASYNCH1 in the EIC_ASYNCH register */
#define EIC_ASYNCH_ASYNCH2_Pos                _UINT32_(2)                                          /* (EIC_ASYNCH) Asynchronous Edge Detection Mode 2 Position */
#define EIC_ASYNCH_ASYNCH2_Msk                (_UINT32_(0x1) << EIC_ASYNCH_ASYNCH2_Pos)            /* (EIC_ASYNCH) Asynchronous Edge Detection Mode 2 Mask */
#define EIC_ASYNCH_ASYNCH2(value)             (EIC_ASYNCH_ASYNCH2_Msk & (_UINT32_(value) << EIC_ASYNCH_ASYNCH2_Pos)) /* Assignment of value for ASYNCH2 in the EIC_ASYNCH register */
#define EIC_ASYNCH_ASYNCH3_Pos                _UINT32_(3)                                          /* (EIC_ASYNCH) Asynchronous Edge Detection Mode 3 Position */
#define EIC_ASYNCH_ASYNCH3_Msk                (_UINT32_(0x1) << EIC_ASYNCH_ASYNCH3_Pos)            /* (EIC_ASYNCH) Asynchronous Edge Detection Mode 3 Mask */
#define EIC_ASYNCH_ASYNCH3(value)             (EIC_ASYNCH_ASYNCH3_Msk & (_UINT32_(value) << EIC_ASYNCH_ASYNCH3_Pos)) /* Assignment of value for ASYNCH3 in the EIC_ASYNCH register */
#define EIC_ASYNCH_ASYNCH4_Pos                _UINT32_(4)                                          /* (EIC_ASYNCH) Asynchronous Edge Detection Mode 4 Position */
#define EIC_ASYNCH_ASYNCH4_Msk                (_UINT32_(0x1) << EIC_ASYNCH_ASYNCH4_Pos)            /* (EIC_ASYNCH) Asynchronous Edge Detection Mode 4 Mask */
#define EIC_ASYNCH_ASYNCH4(value)             (EIC_ASYNCH_ASYNCH4_Msk & (_UINT32_(value) << EIC_ASYNCH_ASYNCH4_Pos)) /* Assignment of value for ASYNCH4 in the EIC_ASYNCH register */
#define EIC_ASYNCH_ASYNCH5_Pos                _UINT32_(5)                                          /* (EIC_ASYNCH) Asynchronous Edge Detection Mode 5 Position */
#define EIC_ASYNCH_ASYNCH5_Msk                (_UINT32_(0x1) << EIC_ASYNCH_ASYNCH5_Pos)            /* (EIC_ASYNCH) Asynchronous Edge Detection Mode 5 Mask */
#define EIC_ASYNCH_ASYNCH5(value)             (EIC_ASYNCH_ASYNCH5_Msk & (_UINT32_(value) << EIC_ASYNCH_ASYNCH5_Pos)) /* Assignment of value for ASYNCH5 in the EIC_ASYNCH register */
#define EIC_ASYNCH_ASYNCH6_Pos                _UINT32_(6)                                          /* (EIC_ASYNCH) Asynchronous Edge Detection Mode 6 Position */
#define EIC_ASYNCH_ASYNCH6_Msk                (_UINT32_(0x1) << EIC_ASYNCH_ASYNCH6_Pos)            /* (EIC_ASYNCH) Asynchronous Edge Detection Mode 6 Mask */
#define EIC_ASYNCH_ASYNCH6(value)             (EIC_ASYNCH_ASYNCH6_Msk & (_UINT32_(value) << EIC_ASYNCH_ASYNCH6_Pos)) /* Assignment of value for ASYNCH6 in the EIC_ASYNCH register */
#define EIC_ASYNCH_ASYNCH7_Pos                _UINT32_(7)                                          /* (EIC_ASYNCH) Asynchronous Edge Detection Mode 7 Position */
#define EIC_ASYNCH_ASYNCH7_Msk                (_UINT32_(0x1) << EIC_ASYNCH_ASYNCH7_Pos)            /* (EIC_ASYNCH) Asynchronous Edge Detection Mode 7 Mask */
#define EIC_ASYNCH_ASYNCH7(value)             (EIC_ASYNCH_ASYNCH7_Msk & (_UINT32_(value) << EIC_ASYNCH_ASYNCH7_Pos)) /* Assignment of value for ASYNCH7 in the EIC_ASYNCH register */
#define EIC_ASYNCH_ASYNCH8_Pos                _UINT32_(8)                                          /* (EIC_ASYNCH) Asynchronous Edge Detection Mode 8 Position */
#define EIC_ASYNCH_ASYNCH8_Msk                (_UINT32_(0x1) << EIC_ASYNCH_ASYNCH8_Pos)            /* (EIC_ASYNCH) Asynchronous Edge Detection Mode 8 Mask */
#define EIC_ASYNCH_ASYNCH8(value)             (EIC_ASYNCH_ASYNCH8_Msk & (_UINT32_(value) << EIC_ASYNCH_ASYNCH8_Pos)) /* Assignment of value for ASYNCH8 in the EIC_ASYNCH register */
#define EIC_ASYNCH_ASYNCH9_Pos                _UINT32_(9)                                          /* (EIC_ASYNCH) Asynchronous Edge Detection Mode 9 Position */
#define EIC_ASYNCH_ASYNCH9_Msk                (_UINT32_(0x1) << EIC_ASYNCH_ASYNCH9_Pos)            /* (EIC_ASYNCH) Asynchronous Edge Detection Mode 9 Mask */
#define EIC_ASYNCH_ASYNCH9(value)             (EIC_ASYNCH_ASYNCH9_Msk & (_UINT32_(value) << EIC_ASYNCH_ASYNCH9_Pos)) /* Assignment of value for ASYNCH9 in the EIC_ASYNCH register */
#define EIC_ASYNCH_ASYNCH10_Pos               _UINT32_(10)                                         /* (EIC_ASYNCH) Asynchronous Edge Detection Mode 10 Position */
#define EIC_ASYNCH_ASYNCH10_Msk               (_UINT32_(0x1) << EIC_ASYNCH_ASYNCH10_Pos)           /* (EIC_ASYNCH) Asynchronous Edge Detection Mode 10 Mask */
#define EIC_ASYNCH_ASYNCH10(value)            (EIC_ASYNCH_ASYNCH10_Msk & (_UINT32_(value) << EIC_ASYNCH_ASYNCH10_Pos)) /* Assignment of value for ASYNCH10 in the EIC_ASYNCH register */
#define EIC_ASYNCH_ASYNCH11_Pos               _UINT32_(11)                                         /* (EIC_ASYNCH) Asynchronous Edge Detection Mode 11 Position */
#define EIC_ASYNCH_ASYNCH11_Msk               (_UINT32_(0x1) << EIC_ASYNCH_ASYNCH11_Pos)           /* (EIC_ASYNCH) Asynchronous Edge Detection Mode 11 Mask */
#define EIC_ASYNCH_ASYNCH11(value)            (EIC_ASYNCH_ASYNCH11_Msk & (_UINT32_(value) << EIC_ASYNCH_ASYNCH11_Pos)) /* Assignment of value for ASYNCH11 in the EIC_ASYNCH register */
#define EIC_ASYNCH_ASYNCH12_Pos               _UINT32_(12)                                         /* (EIC_ASYNCH) Asynchronous Edge Detection Mode 12 Position */
#define EIC_ASYNCH_ASYNCH12_Msk               (_UINT32_(0x1) << EIC_ASYNCH_ASYNCH12_Pos)           /* (EIC_ASYNCH) Asynchronous Edge Detection Mode 12 Mask */
#define EIC_ASYNCH_ASYNCH12(value)            (EIC_ASYNCH_ASYNCH12_Msk & (_UINT32_(value) << EIC_ASYNCH_ASYNCH12_Pos)) /* Assignment of value for ASYNCH12 in the EIC_ASYNCH register */
#define EIC_ASYNCH_ASYNCH13_Pos               _UINT32_(13)                                         /* (EIC_ASYNCH) Asynchronous Edge Detection Mode 13 Position */
#define EIC_ASYNCH_ASYNCH13_Msk               (_UINT32_(0x1) << EIC_ASYNCH_ASYNCH13_Pos)           /* (EIC_ASYNCH) Asynchronous Edge Detection Mode 13 Mask */
#define EIC_ASYNCH_ASYNCH13(value)            (EIC_ASYNCH_ASYNCH13_Msk & (_UINT32_(value) << EIC_ASYNCH_ASYNCH13_Pos)) /* Assignment of value for ASYNCH13 in the EIC_ASYNCH register */
#define EIC_ASYNCH_ASYNCH14_Pos               _UINT32_(14)                                         /* (EIC_ASYNCH) Asynchronous Edge Detection Mode 14 Position */
#define EIC_ASYNCH_ASYNCH14_Msk               (_UINT32_(0x1) << EIC_ASYNCH_ASYNCH14_Pos)           /* (EIC_ASYNCH) Asynchronous Edge Detection Mode 14 Mask */
#define EIC_ASYNCH_ASYNCH14(value)            (EIC_ASYNCH_ASYNCH14_Msk & (_UINT32_(value) << EIC_ASYNCH_ASYNCH14_Pos)) /* Assignment of value for ASYNCH14 in the EIC_ASYNCH register */
#define EIC_ASYNCH_ASYNCH15_Pos               _UINT32_(15)                                         /* (EIC_ASYNCH) Asynchronous Edge Detection Mode 15 Position */
#define EIC_ASYNCH_ASYNCH15_Msk               (_UINT32_(0x1) << EIC_ASYNCH_ASYNCH15_Pos)           /* (EIC_ASYNCH) Asynchronous Edge Detection Mode 15 Mask */
#define EIC_ASYNCH_ASYNCH15(value)            (EIC_ASYNCH_ASYNCH15_Msk & (_UINT32_(value) << EIC_ASYNCH_ASYNCH15_Pos)) /* Assignment of value for ASYNCH15 in the EIC_ASYNCH register */
#define EIC_ASYNCH_Msk                        _UINT32_(0x0000FFFF)                                 /* (EIC_ASYNCH) Register Mask  */

#define EIC_ASYNCH_ASYNCH_Pos                 _UINT32_(0)                                          /* (EIC_ASYNCH Position) Asynchronous Edge Detection Mode x5 */
#define EIC_ASYNCH_ASYNCH_Msk                 (_UINT32_(0xFFFF) << EIC_ASYNCH_ASYNCH_Pos)          /* (EIC_ASYNCH Mask) ASYNCH */
#define EIC_ASYNCH_ASYNCH(value)              (EIC_ASYNCH_ASYNCH_Msk & (_UINT32_(value) << EIC_ASYNCH_ASYNCH_Pos)) 

/* -------- EIC_CONFIG0 : (EIC Offset: 0x1C) (R/W 32) External Interrupt Sense Configuration 0 -------- */
#define EIC_CONFIG0_RESETVALUE                _UINT32_(0x00)                                       /*  (EIC_CONFIG0) External Interrupt Sense Configuration 0  Reset Value */

