Microchip-MPLAB-Harmony/touch_apps/apps/qt8_selfcap_surface_xpro_board/pic32cm_pl10_cnano_water_tolerance/firmware/src/packs/PIC32CM6408PL10048_DFP/component/eic.h
#define EIC_CONFIG1_SENSE8_Pos                _UINT32_(0)                                          /* (EIC_CONFIG1) Input Sense Configuration 8 Position */
#define EIC_CONFIG1_SENSE8_Msk                (_UINT32_(0x7) << EIC_CONFIG1_SENSE8_Pos)            /* (EIC_CONFIG1) Input Sense Configuration 8 Mask */
#define EIC_CONFIG1_SENSE8(value)             (EIC_CONFIG1_SENSE8_Msk & (_UINT32_(value) << EIC_CONFIG1_SENSE8_Pos)) /* Assignment of value for SENSE8 in the EIC_CONFIG1 register */
#define   EIC_CONFIG1_SENSE8_NONE_Val         _UINT32_(0x0)                                        /* (EIC_CONFIG1) No detection  */
#define   EIC_CONFIG1_SENSE8_RISE_Val         _UINT32_(0x1)                                        /* (EIC_CONFIG1) Rising-edge detection  */
#define   EIC_CONFIG1_SENSE8_FALL_Val         _UINT32_(0x2)                                        /* (EIC_CONFIG1) Falling-edge detection  */
#define   EIC_CONFIG1_SENSE8_BOTH_Val         _UINT32_(0x3)                                        /* (EIC_CONFIG1) Both-edge detection  */
#define   EIC_CONFIG1_SENSE8_HIGH_Val         _UINT32_(0x4)                                        /* (EIC_CONFIG1) High-level detection  */
#define   EIC_CONFIG1_SENSE8_LOW_Val          _UINT32_(0x5)                                        /* (EIC_CONFIG1) Low-level detection  */
#define EIC_CONFIG1_SENSE8_NONE               (EIC_CONFIG1_SENSE8_NONE_Val << EIC_CONFIG1_SENSE8_Pos) /* (EIC_CONFIG1) No detection Position */
#define EIC_CONFIG1_SENSE8_RISE               (EIC_CONFIG1_SENSE8_RISE_Val << EIC_CONFIG1_SENSE8_Pos) /* (EIC_CONFIG1) Rising-edge detection Position */
#define EIC_CONFIG1_SENSE8_FALL               (EIC_CONFIG1_SENSE8_FALL_Val << EIC_CONFIG1_SENSE8_Pos) /* (EIC_CONFIG1) Falling-edge detection Position */
#define EIC_CONFIG1_SENSE8_BOTH               (EIC_CONFIG1_SENSE8_BOTH_Val << EIC_CONFIG1_SENSE8_Pos) /* (EIC_CONFIG1) Both-edge detection Position */
#define EIC_CONFIG1_SENSE8_HIGH               (EIC_CONFIG1_SENSE8_HIGH_Val << EIC_CONFIG1_SENSE8_Pos) /* (EIC_CONFIG1) High-level detection Position */
#define EIC_CONFIG1_SENSE8_LOW                (EIC_CONFIG1_SENSE8_LOW_Val << EIC_CONFIG1_SENSE8_Pos) /* (EIC_CONFIG1) Low-level detection Position */
#define EIC_CONFIG1_FILTEN8_Pos               _UINT32_(3)                                          /* (EIC_CONFIG1) Filter Enable 8 Position */
#define EIC_CONFIG1_FILTEN8_Msk               (_UINT32_(0x1) << EIC_CONFIG1_FILTEN8_Pos)           /* (EIC_CONFIG1) Filter Enable 8 Mask */
#define EIC_CONFIG1_FILTEN8(value)            (EIC_CONFIG1_FILTEN8_Msk & (_UINT32_(value) << EIC_CONFIG1_FILTEN8_Pos)) /* Assignment of value for FILTEN8 in the EIC_CONFIG1 register */
#define EIC_CONFIG1_SENSE9_Pos                _UINT32_(4)                                          /* (EIC_CONFIG1) Input Sense Configuration 9 Position */
#define EIC_CONFIG1_SENSE9_Msk                (_UINT32_(0x7) << EIC_CONFIG1_SENSE9_Pos)            /* (EIC_CONFIG1) Input Sense Configuration 9 Mask */
#define EIC_CONFIG1_SENSE9(value)             (EIC_CONFIG1_SENSE9_Msk & (_UINT32_(value) << EIC_CONFIG1_SENSE9_Pos)) /* Assignment of value for SENSE9 in the EIC_CONFIG1 register */
#define   EIC_CONFIG1_SENSE9_NONE_Val         _UINT32_(0x0)                                        /* (EIC_CONFIG1) No detection  */
#define   EIC_CONFIG1_SENSE9_RISE_Val         _UINT32_(0x1)                                        /* (EIC_CONFIG1) Rising-edge detection  */
#define   EIC_CONFIG1_SENSE9_FALL_Val         _UINT32_(0x2)                                        /* (EIC_CONFIG1) Falling-edge detection  */
#define   EIC_CONFIG1_SENSE9_BOTH_Val         _UINT32_(0x3)                                        /* (EIC_CONFIG1) Both-edge detection  */
#define   EIC_CONFIG1_SENSE9_HIGH_Val         _UINT32_(0x4)                                        /* (EIC_CONFIG1) High-level detection  */
#define   EIC_CONFIG1_SENSE9_LOW_Val          _UINT32_(0x5)                                        /* (EIC_CONFIG1) Low-level detection  */
#define EIC_CONFIG1_SENSE9_NONE               (EIC_CONFIG1_SENSE9_NONE_Val << EIC_CONFIG1_SENSE9_Pos) /* (EIC_CONFIG1) No detection Position */
#define EIC_CONFIG1_SENSE9_RISE               (EIC_CONFIG1_SENSE9_RISE_Val << EIC_CONFIG1_SENSE9_Pos) /* (EIC_CONFIG1) Rising-edge detection Position */
#define EIC_CONFIG1_SENSE9_FALL               (EIC_CONFIG1_SENSE9_FALL_Val << EIC_CONFIG1_SENSE9_Pos) /* (EIC_CONFIG1) Falling-edge detection Position */
#define EIC_CONFIG1_SENSE9_BOTH               (EIC_CONFIG1_SENSE9_BOTH_Val << EIC_CONFIG1_SENSE9_Pos) /* (EIC_CONFIG1) Both-edge detection Position */
#define EIC_CONFIG1_SENSE9_HIGH               (EIC_CONFIG1_SENSE9_HIGH_Val << EIC_CONFIG1_SENSE9_Pos) /* (EIC_CONFIG1) High-level detection Position */
#define EIC_CONFIG1_SENSE9_LOW                (EIC_CONFIG1_SENSE9_LOW_Val << EIC_CONFIG1_SENSE9_Pos) /* (EIC_CONFIG1) Low-level detection Position */
#define EIC_CONFIG1_FILTEN9_Pos               _UINT32_(7)                                          /* (EIC_CONFIG1) Filter Enable 9 Position */
#define EIC_CONFIG1_FILTEN9_Msk               (_UINT32_(0x1) << EIC_CONFIG1_FILTEN9_Pos)           /* (EIC_CONFIG1) Filter Enable 9 Mask */
#define EIC_CONFIG1_FILTEN9(value)            (EIC_CONFIG1_FILTEN9_Msk & (_UINT32_(value) << EIC_CONFIG1_FILTEN9_Pos)) /* Assignment of value for FILTEN9 in the EIC_CONFIG1 register */
#define EIC_CONFIG1_SENSE10_Pos               _UINT32_(8)                                          /* (EIC_CONFIG1) Input Sense Configuration 10 Position */
#define EIC_CONFIG1_SENSE10_Msk               (_UINT32_(0x7) << EIC_CONFIG1_SENSE10_Pos)           /* (EIC_CONFIG1) Input Sense Configuration 10 Mask */
#define EIC_CONFIG1_SENSE10(value)            (EIC_CONFIG1_SENSE10_Msk & (_UINT32_(value) << EIC_CONFIG1_SENSE10_Pos)) /* Assignment of value for SENSE10 in the EIC_CONFIG1 register */
#define   EIC_CONFIG1_SENSE10_NONE_Val        _UINT32_(0x0)                                        /* (EIC_CONFIG1) No detection  */
#define   EIC_CONFIG1_SENSE10_RISE_Val        _UINT32_(0x1)                                        /* (EIC_CONFIG1) Rising-edge detection  */
#define   EIC_CONFIG1_SENSE10_FALL_Val        _UINT32_(0x2)                                        /* (EIC_CONFIG1) Falling-edge detection  */
#define   EIC_CONFIG1_SENSE10_BOTH_Val        _UINT32_(0x3)                                        /* (EIC_CONFIG1) Both-edge detection  */
#define   EIC_CONFIG1_SENSE10_HIGH_Val        _UINT32_(0x4)                                        /* (EIC_CONFIG1) High-level detection  */
#define   EIC_CONFIG1_SENSE10_LOW_Val         _UINT32_(0x5)                                        /* (EIC_CONFIG1) Low-level detection  */
#define EIC_CONFIG1_SENSE10_NONE              (EIC_CONFIG1_SENSE10_NONE_Val << EIC_CONFIG1_SENSE10_Pos) /* (EIC_CONFIG1) No detection Position */
#define EIC_CONFIG1_SENSE10_RISE              (EIC_CONFIG1_SENSE10_RISE_Val << EIC_CONFIG1_SENSE10_Pos) /* (EIC_CONFIG1) Rising-edge detection Position */
#define EIC_CONFIG1_SENSE10_FALL              (EIC_CONFIG1_SENSE10_FALL_Val << EIC_CONFIG1_SENSE10_Pos) /* (EIC_CONFIG1) Falling-edge detection Position */
#define EIC_CONFIG1_SENSE10_BOTH              (EIC_CONFIG1_SENSE10_BOTH_Val << EIC_CONFIG1_SENSE10_Pos) /* (EIC_CONFIG1) Both-edge detection Position */
#define EIC_CONFIG1_SENSE10_HIGH              (EIC_CONFIG1_SENSE10_HIGH_Val << EIC_CONFIG1_SENSE10_Pos) /* (EIC_CONFIG1) High-level detection Position */
#define EIC_CONFIG1_SENSE10_LOW               (EIC_CONFIG1_SENSE10_LOW_Val << EIC_CONFIG1_SENSE10_Pos) /* (EIC_CONFIG1) Low-level detection Position */
#define EIC_CONFIG1_FILTEN10_Pos              _UINT32_(11)                                         /* (EIC_CONFIG1) Filter Enable 10 Position */
#define EIC_CONFIG1_FILTEN10_Msk              (_UINT32_(0x1) << EIC_CONFIG1_FILTEN10_Pos)          /* (EIC_CONFIG1) Filter Enable 10 Mask */
#define EIC_CONFIG1_FILTEN10(value)           (EIC_CONFIG1_FILTEN10_Msk & (_UINT32_(value) << EIC_CONFIG1_FILTEN10_Pos)) /* Assignment of value for FILTEN10 in the EIC_CONFIG1 register */
#define EIC_CONFIG1_SENSE11_Pos               _UINT32_(12)                                         /* (EIC_CONFIG1) Input Sense Configuration 11 Position */
#define EIC_CONFIG1_SENSE11_Msk               (_UINT32_(0x7) << EIC_CONFIG1_SENSE11_Pos)           /* (EIC_CONFIG1) Input Sense Configuration 11 Mask */
#define EIC_CONFIG1_SENSE11(value)            (EIC_CONFIG1_SENSE11_Msk & (_UINT32_(value) << EIC_CONFIG1_SENSE11_Pos)) /* Assignment of value for SENSE11 in the EIC_CONFIG1 register */
#define   EIC_CONFIG1_SENSE11_NONE_Val        _UINT32_(0x0)                                        /* (EIC_CONFIG1) No detection  */
#define   EIC_CONFIG1_SENSE11_RISE_Val        _UINT32_(0x1)                                        /* (EIC_CONFIG1) Rising-edge detection  */
#define   EIC_CONFIG1_SENSE11_FALL_Val        _UINT32_(0x2)                                        /* (EIC_CONFIG1) Falling-edge detection  */
#define   EIC_CONFIG1_SENSE11_BOTH_Val        _UINT32_(0x3)                                        /* (EIC_CONFIG1) Both-edge detection  */
#define   EIC_CONFIG1_SENSE11_HIGH_Val        _UINT32_(0x4)                                        /* (EIC_CONFIG1) High-level detection  */
#define   EIC_CONFIG1_SENSE11_LOW_Val         _UINT32_(0x5)                                        /* (EIC_CONFIG1) Low-level detection  */
#define EIC_CONFIG1_SENSE11_NONE              (EIC_CONFIG1_SENSE11_NONE_Val << EIC_CONFIG1_SENSE11_Pos) /* (EIC_CONFIG1) No detection Position */
#define EIC_CONFIG1_SENSE11_RISE              (EIC_CONFIG1_SENSE11_RISE_Val << EIC_CONFIG1_SENSE11_Pos) /* (EIC_CONFIG1) Rising-edge detection Position */
#define EIC_CONFIG1_SENSE11_FALL              (EIC_CONFIG1_SENSE11_FALL_Val << EIC_CONFIG1_SENSE11_Pos) /* (EIC_CONFIG1) Falling-edge detection Position */
#define EIC_CONFIG1_SENSE11_BOTH              (EIC_CONFIG1_SENSE11_BOTH_Val << EIC_CONFIG1_SENSE11_Pos) /* (EIC_CONFIG1) Both-edge detection Position */
#define EIC_CONFIG1_SENSE11_HIGH              (EIC_CONFIG1_SENSE11_HIGH_Val << EIC_CONFIG1_SENSE11_Pos) /* (EIC_CONFIG1) High-level detection Position */
#define EIC_CONFIG1_SENSE11_LOW               (EIC_CONFIG1_SENSE11_LOW_Val << EIC_CONFIG1_SENSE11_Pos) /* (EIC_CONFIG1) Low-level detection Position */
#define EIC_CONFIG1_FILTEN11_Pos              _UINT32_(15)                                         /* (EIC_CONFIG1) Filter Enable 11 Position */
#define EIC_CONFIG1_FILTEN11_Msk              (_UINT32_(0x1) << EIC_CONFIG1_FILTEN11_Pos)          /* (EIC_CONFIG1) Filter Enable 11 Mask */
#define EIC_CONFIG1_FILTEN11(value)           (EIC_CONFIG1_FILTEN11_Msk & (_UINT32_(value) << EIC_CONFIG1_FILTEN11_Pos)) /* Assignment of value for FILTEN11 in the EIC_CONFIG1 register */
#define EIC_CONFIG1_SENSE12_Pos               _UINT32_(16)                                         /* (EIC_CONFIG1) Input Sense Configuration 12 Position */
#define EIC_CONFIG1_SENSE12_Msk               (_UINT32_(0x7) << EIC_CONFIG1_SENSE12_Pos)           /* (EIC_CONFIG1) Input Sense Configuration 12 Mask */
#define EIC_CONFIG1_SENSE12(value)            (EIC_CONFIG1_SENSE12_Msk & (_UINT32_(value) << EIC_CONFIG1_SENSE12_Pos)) /* Assignment of value for SENSE12 in the EIC_CONFIG1 register */
#define   EIC_CONFIG1_SENSE12_NONE_Val        _UINT32_(0x0)                                        /* (EIC_CONFIG1) No detection  */
#define   EIC_CONFIG1_SENSE12_RISE_Val        _UINT32_(0x1)                                        /* (EIC_CONFIG1) Rising-edge detection  */
#define   EIC_CONFIG1_SENSE12_FALL_Val        _UINT32_(0x2)                                        /* (EIC_CONFIG1) Falling-edge detection  */
#define   EIC_CONFIG1_SENSE12_BOTH_Val        _UINT32_(0x3)                                        /* (EIC_CONFIG1) Both-edge detection  */
#define   EIC_CONFIG1_SENSE12_HIGH_Val        _UINT32_(0x4)                                        /* (EIC_CONFIG1) High-level detection  */
#define   EIC_CONFIG1_SENSE12_LOW_Val         _UINT32_(0x5)                                        /* (EIC_CONFIG1) Low-level detection  */
#define EIC_CONFIG1_SENSE12_NONE              (EIC_CONFIG1_SENSE12_NONE_Val << EIC_CONFIG1_SENSE12_Pos) /* (EIC_CONFIG1) No detection Position */
#define EIC_CONFIG1_SENSE12_RISE              (EIC_CONFIG1_SENSE12_RISE_Val << EIC_CONFIG1_SENSE12_Pos) /* (EIC_CONFIG1) Rising-edge detection Position */
#define EIC_CONFIG1_SENSE12_FALL              (EIC_CONFIG1_SENSE12_FALL_Val << EIC_CONFIG1_SENSE12_Pos) /* (EIC_CONFIG1) Falling-edge detection Position */
#define EIC_CONFIG1_SENSE12_BOTH              (EIC_CONFIG1_SENSE12_BOTH_Val << EIC_CONFIG1_SENSE12_Pos) /* (EIC_CONFIG1) Both-edge detection Position */
#define EIC_CONFIG1_SENSE12_HIGH              (EIC_CONFIG1_SENSE12_HIGH_Val << EIC_CONFIG1_SENSE12_Pos) /* (EIC_CONFIG1) High-level detection Position */
#define EIC_CONFIG1_SENSE12_LOW               (EIC_CONFIG1_SENSE12_LOW_Val << EIC_CONFIG1_SENSE12_Pos) /* (EIC_CONFIG1) Low-level detection Position */
#define EIC_CONFIG1_FILTEN12_Pos              _UINT32_(19)                                         /* (EIC_CONFIG1) Filter Enable 12 Position */
#define EIC_CONFIG1_FILTEN12_Msk              (_UINT32_(0x1) << EIC_CONFIG1_FILTEN12_Pos)          /* (EIC_CONFIG1) Filter Enable 12 Mask */
#define EIC_CONFIG1_FILTEN12(value)           (EIC_CONFIG1_FILTEN12_Msk & (_UINT32_(value) << EIC_CONFIG1_FILTEN12_Pos)) /* Assignment of value for FILTEN12 in the EIC_CONFIG1 register */
#define EIC_CONFIG1_SENSE13_Pos               _UINT32_(20)                                         /* (EIC_CONFIG1) Input Sense Configuration 13 Position */
#define EIC_CONFIG1_SENSE13_Msk               (_UINT32_(0x7) << EIC_CONFIG1_SENSE13_Pos)           /* (EIC_CONFIG1) Input Sense Configuration 13 Mask */
#define EIC_CONFIG1_SENSE13(value)            (EIC_CONFIG1_SENSE13_Msk & (_UINT32_(value) << EIC_CONFIG1_SENSE13_Pos)) /* Assignment of value for SENSE13 in the EIC_CONFIG1 register */
#define   EIC_CONFIG1_SENSE13_NONE_Val        _UINT32_(0x0)                                        /* (EIC_CONFIG1) No detection  */
#define   EIC_CONFIG1_SENSE13_RISE_Val        _UINT32_(0x1)                                        /* (EIC_CONFIG1) Rising-edge detection  */
#define   EIC_CONFIG1_SENSE13_FALL_Val        _UINT32_(0x2)                                        /* (EIC_CONFIG1) Falling-edge detection  */
#define   EIC_CONFIG1_SENSE13_BOTH_Val        _UINT32_(0x3)                                        /* (EIC_CONFIG1) Both-edge detection  */
#define   EIC_CONFIG1_SENSE13_HIGH_Val        _UINT32_(0x4)                                        /* (EIC_CONFIG1) High-level detection  */
#define   EIC_CONFIG1_SENSE13_LOW_Val         _UINT32_(0x5)                                        /* (EIC_CONFIG1) Low-level detection  */
#define EIC_CONFIG1_SENSE13_NONE              (EIC_CONFIG1_SENSE13_NONE_Val << EIC_CONFIG1_SENSE13_Pos) /* (EIC_CONFIG1) No detection Position */
#define EIC_CONFIG1_SENSE13_RISE              (EIC_CONFIG1_SENSE13_RISE_Val << EIC_CONFIG1_SENSE13_Pos) /* (EIC_CONFIG1) Rising-edge detection Position */
#define EIC_CONFIG1_SENSE13_FALL              (EIC_CONFIG1_SENSE13_FALL_Val << EIC_CONFIG1_SENSE13_Pos) /* (EIC_CONFIG1) Falling-edge detection Position */
#define EIC_CONFIG1_SENSE13_BOTH              (EIC_CONFIG1_SENSE13_BOTH_Val << EIC_CONFIG1_SENSE13_Pos) /* (EIC_CONFIG1) Both-edge detection Position */
#define EIC_CONFIG1_SENSE13_HIGH              (EIC_CONFIG1_SENSE13_HIGH_Val << EIC_CONFIG1_SENSE13_Pos) /* (EIC_CONFIG1) High-level detection Position */
#define EIC_CONFIG1_SENSE13_LOW               (EIC_CONFIG1_SENSE13_LOW_Val << EIC_CONFIG1_SENSE13_Pos) /* (EIC_CONFIG1) Low-level detection Position */
#define EIC_CONFIG1_FILTEN13_Pos              _UINT32_(23)                                         /* (EIC_CONFIG1) Filter Enable 13 Position */
#define EIC_CONFIG1_FILTEN13_Msk              (_UINT32_(0x1) << EIC_CONFIG1_FILTEN13_Pos)          /* (EIC_CONFIG1) Filter Enable 13 Mask */
#define EIC_CONFIG1_FILTEN13(value)           (EIC_CONFIG1_FILTEN13_Msk & (_UINT32_(value) << EIC_CONFIG1_FILTEN13_Pos)) /* Assignment of value for FILTEN13 in the EIC_CONFIG1 register */
#define EIC_CONFIG1_SENSE14_Pos               _UINT32_(24)                                         /* (EIC_CONFIG1) Input Sense Configuration 14 Position */
#define EIC_CONFIG1_SENSE14_Msk               (_UINT32_(0x7) << EIC_CONFIG1_SENSE14_Pos)           /* (EIC_CONFIG1) Input Sense Configuration 14 Mask */
#define EIC_CONFIG1_SENSE14(value)            (EIC_CONFIG1_SENSE14_Msk & (_UINT32_(value) << EIC_CONFIG1_SENSE14_Pos)) /* Assignment of value for SENSE14 in the EIC_CONFIG1 register */
#define   EIC_CONFIG1_SENSE14_NONE_Val        _UINT32_(0x0)                                        /* (EIC_CONFIG1) No detection  */
#define   EIC_CONFIG1_SENSE14_RISE_Val        _UINT32_(0x1)                                        /* (EIC_CONFIG1) Rising-edge detection  */
#define   EIC_CONFIG1_SENSE14_FALL_Val        _UINT32_(0x2)                                        /* (EIC_CONFIG1) Falling-edge detection  */
#define   EIC_CONFIG1_SENSE14_BOTH_Val        _UINT32_(0x3)                                        /* (EIC_CONFIG1) Both-edge detection  */
#define   EIC_CONFIG1_SENSE14_HIGH_Val        _UINT32_(0x4)                                        /* (EIC_CONFIG1) High-level detection  */
#define   EIC_CONFIG1_SENSE14_LOW_Val         _UINT32_(0x5)                                        /* (EIC_CONFIG1) Low-level detection  */
#define EIC_CONFIG1_SENSE14_NONE              (EIC_CONFIG1_SENSE14_NONE_Val << EIC_CONFIG1_SENSE14_Pos) /* (EIC_CONFIG1) No detection Position */
#define EIC_CONFIG1_SENSE14_RISE              (EIC_CONFIG1_SENSE14_RISE_Val << EIC_CONFIG1_SENSE14_Pos) /* (EIC_CONFIG1) Rising-edge detection Position */
#define EIC_CONFIG1_SENSE14_FALL              (EIC_CONFIG1_SENSE14_FALL_Val << EIC_CONFIG1_SENSE14_Pos) /* (EIC_CONFIG1) Falling-edge detection Position */
#define EIC_CONFIG1_SENSE14_BOTH              (EIC_CONFIG1_SENSE14_BOTH_Val << EIC_CONFIG1_SENSE14_Pos) /* (EIC_CONFIG1) Both-edge detection Position */
#define EIC_CONFIG1_SENSE14_HIGH              (EIC_CONFIG1_SENSE14_HIGH_Val << EIC_CONFIG1_SENSE14_Pos) /* (EIC_CONFIG1) High-level detection Position */
#define EIC_CONFIG1_SENSE14_LOW               (EIC_CONFIG1_SENSE14_LOW_Val << EIC_CONFIG1_SENSE14_Pos) /* (EIC_CONFIG1) Low-level detection Position */
#define EIC_CONFIG1_FILTEN14_Pos              _UINT32_(27)                                         /* (EIC_CONFIG1) Filter Enable 14 Position */
#define EIC_CONFIG1_FILTEN14_Msk              (_UINT32_(0x1) << EIC_CONFIG1_FILTEN14_Pos)          /* (EIC_CONFIG1) Filter Enable 14 Mask */
#define EIC_CONFIG1_FILTEN14(value)           (EIC_CONFIG1_FILTEN14_Msk & (_UINT32_(value) << EIC_CONFIG1_FILTEN14_Pos)) /* Assignment of value for FILTEN14 in the EIC_CONFIG1 register */
#define EIC_CONFIG1_SENSE15_Pos               _UINT32_(28)                                         /* (EIC_CONFIG1) Input Sense Configuration 15 Position */
#define EIC_CONFIG1_SENSE15_Msk               (_UINT32_(0x7) << EIC_CONFIG1_SENSE15_Pos)           /* (EIC_CONFIG1) Input Sense Configuration 15 Mask */
#define EIC_CONFIG1_SENSE15(value)            (EIC_CONFIG1_SENSE15_Msk & (_UINT32_(value) << EIC_CONFIG1_SENSE15_Pos)) /* Assignment of value for SENSE15 in the EIC_CONFIG1 register */
#define   EIC_CONFIG1_SENSE15_NONE_Val        _UINT32_(0x0)                                        /* (EIC_CONFIG1) No detection  */
#define   EIC_CONFIG1_SENSE15_RISE_Val        _UINT32_(0x1)                                        /* (EIC_CONFIG1) Rising-edge detection  */
#define   EIC_CONFIG1_SENSE15_FALL_Val        _UINT32_(0x2)                                        /* (EIC_CONFIG1) Falling-edge detection  */
#define   EIC_CONFIG1_SENSE15_BOTH_Val        _UINT32_(0x3)                                        /* (EIC_CONFIG1) Both-edge detection  */
#define   EIC_CONFIG1_SENSE15_HIGH_Val        _UINT32_(0x4)                                        /* (EIC_CONFIG1) High-level detection  */
#define   EIC_CONFIG1_SENSE15_LOW_Val         _UINT32_(0x5)                                        /* (EIC_CONFIG1) Low-level detection  */
#define EIC_CONFIG1_SENSE15_NONE              (EIC_CONFIG1_SENSE15_NONE_Val << EIC_CONFIG1_SENSE15_Pos) /* (EIC_CONFIG1) No detection Position */
#define EIC_CONFIG1_SENSE15_RISE              (EIC_CONFIG1_SENSE15_RISE_Val << EIC_CONFIG1_SENSE15_Pos) /* (EIC_CONFIG1) Rising-edge detection Position */
#define EIC_CONFIG1_SENSE15_FALL              (EIC_CONFIG1_SENSE15_FALL_Val << EIC_CONFIG1_SENSE15_Pos) /* (EIC_CONFIG1) Falling-edge detection Position */
#define EIC_CONFIG1_SENSE15_BOTH              (EIC_CONFIG1_SENSE15_BOTH_Val << EIC_CONFIG1_SENSE15_Pos) /* (EIC_CONFIG1) Both-edge detection Position */
#define EIC_CONFIG1_SENSE15_HIGH              (EIC_CONFIG1_SENSE15_HIGH_Val << EIC_CONFIG1_SENSE15_Pos) /* (EIC_CONFIG1) High-level detection Position */
#define EIC_CONFIG1_SENSE15_LOW               (EIC_CONFIG1_SENSE15_LOW_Val << EIC_CONFIG1_SENSE15_Pos) /* (EIC_CONFIG1) Low-level detection Position */
#define EIC_CONFIG1_FILTEN15_Pos              _UINT32_(31)                                         /* (EIC_CONFIG1) Filter Enable 15 Position */
#define EIC_CONFIG1_FILTEN15_Msk              (_UINT32_(0x1) << EIC_CONFIG1_FILTEN15_Pos)          /* (EIC_CONFIG1) Filter Enable 15 Mask */
#define EIC_CONFIG1_FILTEN15(value)           (EIC_CONFIG1_FILTEN15_Msk & (_UINT32_(value) << EIC_CONFIG1_FILTEN15_Pos)) /* Assignment of value for FILTEN15 in the EIC_CONFIG1 register */
#define EIC_CONFIG1_Msk                       _UINT32_(0xFFFFFFFF)                                 /* (EIC_CONFIG1) Register Mask  */


/* EIC register offsets definitions */
#define EIC_CTRLA_REG_OFST             _UINT32_(0x00)      /* (EIC_CTRLA) Control A Offset */
#define EIC_NMICTRL_REG_OFST           _UINT32_(0x01)      /* (EIC_NMICTRL) Non-Maskable Interrupt Control Offset */
#define EIC_NMIFLAG_REG_OFST           _UINT32_(0x02)      /* (EIC_NMIFLAG) Non-Maskable Interrupt Flag Status and Clear Offset */
#define EIC_SYNCBUSY_REG_OFST          _UINT32_(0x04)      /* (EIC_SYNCBUSY) Synchronization Busy Offset */
#define EIC_EVCTRL_REG_OFST            _UINT32_(0x08)      /* (EIC_EVCTRL) Event Control Offset */
#define EIC_INTENCLR_REG_OFST          _UINT32_(0x0C)      /* (EIC_INTENCLR) Interrupt Enable Clear Offset */
#define EIC_INTENSET_REG_OFST          _UINT32_(0x10)      /* (EIC_INTENSET) Interrupt Enable Set Offset */
#define EIC_INTFLAG_REG_OFST           _UINT32_(0x14)      /* (EIC_INTFLAG) Interrupt Flag Status and Clear Offset */
#define EIC_ASYNCH_REG_OFST            _UINT32_(0x18)      /* (EIC_ASYNCH) External Interrupt Asynchronous Mode Offset */
#define EIC_CONFIG0_REG_OFST           _UINT32_(0x1C)      /* (EIC_CONFIG0) External Interrupt Sense Configuration 0 Offset */
#define EIC_CONFIG1_REG_OFST           _UINT32_(0x20)      /* (EIC_CONFIG1) External Interrupt Sense Configuration 1 Offset */

